ahtn/keyplus/ports/efm8/efm8/mcu/C8051F540/inc/SI_C8051F540_Register_Enums.h
#define IP_PT1__BMASK   0x08 ///< Timer 1 Interrupt Priority Control                           
#define IP_PT1__SHIFT   0x03 ///< Timer 1 Interrupt Priority Control                           
#define IP_PT1__LOW     0x00 ///< Timer 1 interrupt set to low priority level.                 
#define IP_PT1__HIGH    0x08 ///< Timer 1 interrupt set to high priority level.                
                                                                                               
#define IP_PS0__BMASK   0x10 ///< UART0 Interrupt Priority Control                             
#define IP_PS0__SHIFT   0x04 ///< UART0 Interrupt Priority Control                             
#define IP_PS0__LOW     0x00 ///< UART0 interrupt set to low priority level.                   
#define IP_PS0__HIGH    0x10 ///< UART0 interrupt set to high priority level.                  
                                                                                               
#define IP_PT2__BMASK   0x20 ///< Timer 2 Interrupt Priority Control                           
#define IP_PT2__SHIFT   0x05 ///< Timer 2 Interrupt Priority Control                           
#define IP_PT2__LOW     0x00 ///< Timer 2 interrupt set to low priority level.                 
#define IP_PT2__HIGH    0x20 ///< Timer 2 interrupt set to high priority level.                
                                                                                               
#define IP_PSPI0__BMASK 0x40 ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control
#define IP_PSPI0__SHIFT 0x06 ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control
#define IP_PSPI0__LOW   0x00 ///< SPI0 interrupt set to low priority level.                    
#define IP_PSPI0__HIGH  0x40 ///< SPI0 interrupt set to high priority level.                   
                                                                                               
//------------------------------------------------------------------------------
// LIN0ADR Enums (LIN0 Indirect Address @ 0xD3)
//------------------------------------------------------------------------------
#define LIN0ADR_LINADDR__FMASK    0xFF ///< Indirect Address                      
#define LIN0ADR_LINADDR__SHIFT    0x00 ///< Indirect Address                      
#define LIN0ADR_LINADDR__LIN0DT1  0x00 ///< Select the LIN0DT1 internal register. 
#define LIN0ADR_LINADDR__LIN0DT2  0x01 ///< Select the LIN0DT2 internal register. 
#define LIN0ADR_LINADDR__LIN0DT3  0x02 ///< Select the LIN0DT3 internal register. 
#define LIN0ADR_LINADDR__LIN0DT4  0x03 ///< Select the LIN0DT4 internal register. 
#define LIN0ADR_LINADDR__LIN0DT5  0x04 ///< Select the LIN0DT5 internal register. 
#define LIN0ADR_LINADDR__LIN0DT6  0x05 ///< Select the LIN0DT6 internal register. 
#define LIN0ADR_LINADDR__LIN0DT7  0x06 ///< Select the LIN0DT7 internal register. 
#define LIN0ADR_LINADDR__LIN0DT8  0x07 ///< Select the LIN0DT8 internal register. 
#define LIN0ADR_LINADDR__LIN0CTRL 0x08 ///< Select the LIN0CTRL internal register.
#define LIN0ADR_LINADDR__LIN0ST   0x09 ///< Select the LIN0ST internal register.  
#define LIN0ADR_LINADDR__LIN0ERR  0x0A ///< Select the LIN0ERR internal register. 
#define LIN0ADR_LINADDR__LIN0SIZE 0x0B ///< Select the LIN0SIZE internal register.
#define LIN0ADR_LINADDR__LIN0DIV  0x0C ///< Select the LIN0DIV internal register. 
#define LIN0ADR_LINADDR__LIN0MUL  0x0D ///< Select the LIN0MUL internal register. 
#define LIN0ADR_LINADDR__LIN0ID   0x0E ///< Select the LIN0ID internal register.  
                                                                                  
//------------------------------------------------------------------------------
// LIN0CF Enums (LIN0 Control Mode @ 0xC9)
//------------------------------------------------------------------------------
#define LIN0CF_ABAUD__BMASK    0x20 ///< Automatic Baud Rate Enable                
#define LIN0CF_ABAUD__SHIFT    0x05 ///< Automatic Baud Rate Enable                
#define LIN0CF_ABAUD__DISABLED 0x00 ///< Disable auto-baud and use manual baud rate
                                    ///< selection.                                
#define LIN0CF_ABAUD__ENABLED  0x20 ///< Enable auto-baud.                         
                                                                                   
#define LIN0CF_MODE__BMASK     0x40 ///< Mode Selection                            
#define LIN0CF_MODE__SHIFT     0x06 ///< Mode Selection                            
#define LIN0CF_MODE__SLAVE     0x00 ///< LIN0 operates in slave mode.              
#define LIN0CF_MODE__MASTER    0x40 ///< LIN0 operates in master mode.             
                                                                                   
#define LIN0CF_LINEN__BMASK    0x80 ///< Interface Enable                          
#define LIN0CF_LINEN__SHIFT    0x07 ///< Interface Enable                          
#define LIN0CF_LINEN__DISABLED 0x00 ///< Disable the LIN0 module.                  
#define LIN0CF_LINEN__ENABLED  0x80 ///< Enable the LIN0 module.                   
                                                                                   
//------------------------------------------------------------------------------
// LIN0CTRL Enums (LIN0 Control @ 0x08)
//------------------------------------------------------------------------------
#define LIN0CTRL_STREQ__BMASK   0x01 ///< Start Request                                     
#define LIN0CTRL_STREQ__SHIFT   0x00 ///< Start Request                                     
#define LIN0CTRL_STREQ__START   0x01 ///< Start a LIN transmission. Firmware should set this
                                     ///< bit after loading the identifier, data length, and
                                     ///< data buffer, if necessary.                        
                                                                                            
#define LIN0CTRL_WUPREQ__BMASK  0x02 ///< Wake-Up Request                                   
#define LIN0CTRL_WUPREQ__SHIFT  0x01 ///< Wake-Up Request                                   
#define LIN0CTRL_WUPREQ__WAKEUP 0x02 ///< Terminate sleep mode by sending a wakeup signal.  
                                                                                            
#define LIN0CTRL_RSTERR__BMASK  0x04 ///< Error Reset                                       
#define LIN0CTRL_RSTERR__SHIFT  0x02 ///< Error Reset                                       
#define LIN0CTRL_RSTERR__RESET  0x04 ///< Clear the error bits in the LIN0ST and LIN0ERR    
                                     ///< registers.                                        
                                                                                            
#define LIN0CTRL_RSTINT__BMASK  0x08 ///< Interrupt Reset                                   
#define LIN0CTRL_RSTINT__SHIFT  0x03 ///< Interrupt Reset                                   
#define LIN0CTRL_RSTINT__RESET  0x08 ///< Clear the LININT interrupt flag.                  
                                                                                            
#define LIN0CTRL_DTACK__BMASK   0x10 ///< Data Acknowledge                                  
#define LIN0CTRL_DTACK__SHIFT   0x04 ///< Data Acknowledge                                  
#define LIN0CTRL_DTACK__ACK     0x10 ///< Acknowledge the transfer after a data request     
                                     ///< interrupt.                                        
                                                                                            
