ahtn/keyplus/ports/efm8/efm8/mcu/C8051F540/inc/SI_C8051F540_Register_Enums.h
#define LIN0ST_WAKEUP__BMASK    0x02 ///< Wake-Up Flag                                      
#define LIN0ST_WAKEUP__SHIFT    0x01 ///< Wake-Up Flag                                      
#define LIN0ST_WAKEUP__NOT_SET  0x00 ///< A wakeup signal is not being transmitted and has  
                                     ///< not been received.                                
#define LIN0ST_WAKEUP__SET      0x02 ///< A wakeup signal is being transmitted or has been  
                                     ///< received.                                         
                                                                                            
#define LIN0ST_ERROR__BMASK     0x04 ///< Communication Error Flag                          
#define LIN0ST_ERROR__SHIFT     0x02 ///< Communication Error Flag                          
#define LIN0ST_ERROR__NOT_SET   0x00 ///< No error has been detected. This bit is cleared by
                                     ///< setting RSTERR                                    
#define LIN0ST_ERROR__SET       0x04 ///< An error has been detected.                       
                                                                                            
#define LIN0ST_LININT__BMASK    0x08 ///< Interrupt Request Flag                            
#define LIN0ST_LININT__SHIFT    0x03 ///< Interrupt Request Flag                            
#define LIN0ST_LININT__NOT_SET  0x00 ///< An interrupt is not pending.                      
#define LIN0ST_LININT__SET      0x08 ///< A LIN0 interrupt is pending.                      
                                                                                            
#define LIN0ST_DTREQ__BMASK     0x10 ///< Data Request Flag                                 
#define LIN0ST_DTREQ__SHIFT     0x04 ///< Data Request Flag                                 
#define LIN0ST_DTREQ__NOT_SET   0x00 ///< A data identifier has not been received.          
#define LIN0ST_DTREQ__SET       0x10 ///< A data identifier has been received.              
                                                                                            
#define LIN0ST_ABORT__BMASK     0x20 ///< Aborted Transmission Signal Flag                  
#define LIN0ST_ABORT__SHIFT     0x05 ///< Aborted Transmission Signal Flag                  
#define LIN0ST_ABORT__NOT_SET   0x00 ///< The current transmission has not been interrupted 
                                     ///< or stopped.                                       
#define LIN0ST_ABORT__SET       0x20 ///< Hardware detected a new SYNCH BREAK before the end
                                     ///< of the last transmission or firmware set the STOP 
                                     ///< bit.                                              
                                                                                            
#define LIN0ST_IDLTOUT__BMASK   0x40 ///< Bus Idle Timeout Flag                             
#define LIN0ST_IDLTOUT__SHIFT   0x06 ///< Bus Idle Timeout Flag                             
#define LIN0ST_IDLTOUT__NOT_SET 0x00 ///< The bus has not been idle for four seconds.       
#define LIN0ST_IDLTOUT__SET     0x40 ///< No bus activity has been detected for four        
                                     ///< seconds, but the bus is not yet in sleep mode.    
                                                                                            
#define LIN0ST_ACTIVE__BMASK    0x80 ///< LIN Bus Activity Flag                             
#define LIN0ST_ACTIVE__SHIFT    0x07 ///< LIN Bus Activity Flag                             
#define LIN0ST_ACTIVE__NOT_SET  0x00 ///< No transmission activity detected on the LIN bus. 
#define LIN0ST_ACTIVE__SET      0x80 ///< Transmission activity detected on the LIN bus.    
                                                                                            
//------------------------------------------------------------------------------
// XBR0 Enums (Port I/O Crossbar 0 @ 0xE1)
//------------------------------------------------------------------------------
#define XBR0_URT0E__BMASK    0x01 ///< UART I/O Output Enable                        
#define XBR0_URT0E__SHIFT    0x00 ///< UART I/O Output Enable                        
#define XBR0_URT0E__DISABLED 0x00 ///< UART I/O unavailable at Port pin.             
#define XBR0_URT0E__ENABLED  0x01 ///< UART TX, RX routed to Port pins P0.4 and P0.5.
                                                                                     
#define XBR0_SPI0E__BMASK    0x04 ///< SPI I/O Enable                                
#define XBR0_SPI0E__SHIFT    0x02 ///< SPI I/O Enable                                
#define XBR0_SPI0E__DISABLED 0x00 ///< SPI I/O unavailable at Port pins.             
#define XBR0_SPI0E__ENABLED  0x04 ///< SPI I/O routed to Port pins. The SPI can be   
                                  ///< assigned either 3 or 4 GPIO pins.             
                                                                                     
#define XBR0_SMB0E__BMASK    0x08 ///< SMBus0 I/O Enable                             
#define XBR0_SMB0E__SHIFT    0x03 ///< SMBus0 I/O Enable                             
#define XBR0_SMB0E__DISABLED 0x00 ///< SMBus0 I/O unavailable at Port pins.          
#define XBR0_SMB0E__ENABLED  0x08 ///< SMBus0 I/O routed to Port pins.               
                                                                                     
#define XBR0_CP0E__BMASK     0x10 ///< Comparator0 Output Enable                     
#define XBR0_CP0E__SHIFT     0x04 ///< Comparator0 Output Enable                     
#define XBR0_CP0E__DISABLED  0x00 ///< CP0 unavailable at Port pin.                  
#define XBR0_CP0E__ENABLED   0x10 ///< CP0 routed to Port pin.                       
                                                                                     
#define XBR0_CP0AE__BMASK    0x20 ///< Comparator0 Asynchronous Output Enable        
#define XBR0_CP0AE__SHIFT    0x05 ///< Comparator0 Asynchronous Output Enable        
#define XBR0_CP0AE__DISABLED 0x00 ///< Asynchronous CP0 unavailable at Port pin.     
#define XBR0_CP0AE__ENABLED  0x20 ///< Asynchronous CP0 routed to Port pin.          
                                                                                     
