ahtn/keyplus/ports/efm8/efm8/mcu/C8051F540/inc/SI_C8051F540_Register_Enums.h
#define XBR0_CP1E__BMASK     0x40 ///< Comparator1 Output Enable                     
#define XBR0_CP1E__SHIFT     0x06 ///< Comparator1 Output Enable                     
#define XBR0_CP1E__DISABLED  0x00 ///< CP1 unavailable at Port pin.                  
#define XBR0_CP1E__ENABLED   0x40 ///< CP1 routed to Port pin.                       
                                                                                     
#define XBR0_CP1AE__BMASK    0x80 ///< Comparator1 Asynchronous Output Enable        
#define XBR0_CP1AE__SHIFT    0x07 ///< Comparator1 Asynchronous Output Enable        
#define XBR0_CP1AE__DISABLED 0x00 ///< Asynchronous CP1 unavailable at Port pin.     
#define XBR0_CP1AE__ENABLED  0x80 ///< Asynchronous CP1 routed to Port pin.          
                                                                                     
//------------------------------------------------------------------------------
// XBR1 Enums (Port I/O Crossbar 1 @ 0xE2)
//------------------------------------------------------------------------------
#define XBR1_SYSCKE__BMASK                         0x02 ///< SYSCLK Output Enable                             
#define XBR1_SYSCKE__SHIFT                         0x01 ///< SYSCLK Output Enable                             
#define XBR1_SYSCKE__DISABLED                      0x00 ///< SYSCLK unavailable at Port pin.                  
#define XBR1_SYSCKE__ENABLED                       0x02 ///< SYSCLK output routed to Port pin.                
                                                                                                              
#define XBR1_PCA0ME__FMASK                         0x1C ///< PCA Module I/O Enable                            
#define XBR1_PCA0ME__SHIFT                         0x02 ///< PCA Module I/O Enable                            
#define XBR1_PCA0ME__DISABLED                      0x00 ///< All PCA I/O unavailable at Port pins.            
#define XBR1_PCA0ME__CEX0                          0x04 ///< CEX0 routed to Port pin.                         
#define XBR1_PCA0ME__CEX0_CEX1                     0x08 ///< CEX0, CEX1 routed to Port pins.                  
#define XBR1_PCA0ME__CEX0_CEX1_CEX2                0x0C ///< CEX0, CEX1, CEX2 routed to Port pins.            
#define XBR1_PCA0ME__CEX0_CEX1_CEX2_CEX3           0x10 ///< CEX0, CEX1, CEX2, CEX3 routed to Port pins.      
#define XBR1_PCA0ME__CEX0_CEX1_CEX2_CEX3_CEX4      0x14 ///< CEX0, CEX1, CEX2, CEX3, CEX4 routed to Port pins.
#define XBR1_PCA0ME__CEX0_CEX1_CEX2_CEX3_CEX4_CEX5 0x18 ///< CEX0, CEX1, CEX2, CEX3, CEX4, CEX5 routed to Port
                                                        ///< pins.                                            
                                                                                                              
#define XBR1_ECIE__BMASK                           0x20 ///< PCA0 External Counter Input Enable               
#define XBR1_ECIE__SHIFT                           0x05 ///< PCA0 External Counter Input Enable               
#define XBR1_ECIE__DISABLED                        0x00 ///< ECI unavailable at Port pin.                     
#define XBR1_ECIE__ENABLED                         0x20 ///< ECI routed to Port pin.                          
                                                                                                              
#define XBR1_T0E__BMASK                            0x40 ///< T0 Enable                                        
#define XBR1_T0E__SHIFT                            0x06 ///< T0 Enable                                        
#define XBR1_T0E__DISABLED                         0x00 ///< T0 unavailable at Port pin.                      
#define XBR1_T0E__ENABLED                          0x40 ///< T0 routed to Port pin.                           
                                                                                                              
#define XBR1_T1E__BMASK                            0x80 ///< T1 Enable                                        
#define XBR1_T1E__SHIFT                            0x07 ///< T1 Enable                                        
#define XBR1_T1E__DISABLED                         0x00 ///< T1 unavailable at Port pin.                      
#define XBR1_T1E__ENABLED                          0x80 ///< T1 routed to Port pin.                           
                                                                                                              
//------------------------------------------------------------------------------
// XBR2 Enums (Port I/O Crossbar 2 @ 0xC7)
//------------------------------------------------------------------------------
#define XBR2_LIN0E__BMASK               0x01 ///< LIN0 I/O Enable                                 
#define XBR2_LIN0E__SHIFT               0x00 ///< LIN0 I/O Enable                                 
#define XBR2_LIN0E__DISABLED            0x00 ///< LIN0 I/O unavailable at Port pins.              
#define XBR2_LIN0E__ENABLED             0x01 ///< LIN0 I/O routed to Port pins.                   
                                                                                                  
#define XBR2_XBARE__BMASK               0x40 ///< Crossbar Enable                                 
#define XBR2_XBARE__SHIFT               0x06 ///< Crossbar Enable                                 
#define XBR2_XBARE__DISABLED            0x00 ///< Crossbar disabled.                              
#define XBR2_XBARE__ENABLED             0x40 ///< Crossbar enabled.                               
                                                                                                  
#define XBR2_WEAKPUD__BMASK             0x80 ///< Port I/O Weak Pullup Disable                    
#define XBR2_WEAKPUD__SHIFT             0x07 ///< Port I/O Weak Pullup Disable                    
#define XBR2_WEAKPUD__PULL_UPS_ENABLED  0x00 ///< Weak Pullups enabled (except for Ports whose I/O
                                             ///< are configured for analog mode).                
#define XBR2_WEAKPUD__PULL_UPS_DISABLED 0x80 ///< Weak Pullups disabled.                          
                                                                                                  
//------------------------------------------------------------------------------
// PCA0CN Enums (PCA Control @ 0xD8)
//------------------------------------------------------------------------------
#define PCA0CN_CCF0__BMASK   0x01 ///< PCA Module 0 Capture/Compare Flag             
#define PCA0CN_CCF0__SHIFT   0x00 ///< PCA Module 0 Capture/Compare Flag             
#define PCA0CN_CCF0__NOT_SET 0x00 ///< A match or capture did not occur on channel 0.
#define PCA0CN_CCF0__SET     0x01 ///< A match or capture occurred on channel 0.     
                                                                                     
#define PCA0CN_CCF1__BMASK   0x02 ///< PCA Module 1 Capture/Compare Flag             
#define PCA0CN_CCF1__SHIFT   0x01 ///< PCA Module 1 Capture/Compare Flag             
#define PCA0CN_CCF1__NOT_SET 0x00 ///< A match or capture did not occur on channel 1.
#define PCA0CN_CCF1__SET     0x02 ///< A match or capture occurred on channel 1.     
                                                                                     
