ahtn/keyplus/ports/efm8/efm8/mcu/C8051F540/inc/SI_C8051F540_Register_Enums.h
#define REF0CN_BIASE__BMASK         0x02 ///< Internal Analog Bias Generator Enable             
#define REF0CN_BIASE__SHIFT         0x01 ///< Internal Analog Bias Generator Enable             
#define REF0CN_BIASE__DISABLED      0x00 ///< Disable the internal bias generator.              
#define REF0CN_BIASE__ENABLED       0x02 ///< Enable the internal bias generator.               
                                                                                                
#define REF0CN_TEMPE__BMASK         0x04 ///< Temperature Sensor Enable                         
#define REF0CN_TEMPE__SHIFT         0x02 ///< Temperature Sensor Enable                         
#define REF0CN_TEMPE__DISABLED      0x00 ///< Disable the internal Temperature Sensor.          
#define REF0CN_TEMPE__ENABLED       0x04 ///< Enable the internal Temperature Sensor.           
                                                                                                
#define REF0CN_REFSL__BMASK         0x08 ///< Voltage Reference Select                          
#define REF0CN_REFSL__SHIFT         0x03 ///< Voltage Reference Select                          
#define REF0CN_REFSL__VREF          0x00 ///< Use the VREF pin as the voltage reference.        
#define REF0CN_REFSL__VDD           0x08 ///< Use VDD as the voltage reference.                 
                                                                                                
#define REF0CN_REFLV__BMASK         0x10 ///< Voltage Reference Output Level                    
#define REF0CN_REFLV__SHIFT         0x04 ///< Voltage Reference Output Level                    
#define REF0CN_REFLV__1P5           0x00 ///< Internal voltage reference set to 1.5 V.          
#define REF0CN_REFLV__2P2           0x10 ///< Internal voltage reference set to 2.2 V.          
                                                                                                
#define REF0CN_ZTCEN__BMASK         0x20 ///< Zero-TempCo Bias Enable                           
#define REF0CN_ZTCEN__SHIFT         0x05 ///< Zero-TempCo Bias Enable                           
#define REF0CN_ZTCEN__AUTOMATIC     0x00 ///< Zero-TC bias generator automatically enabled when 
                                         ///< needed.                                           
#define REF0CN_ZTCEN__FORCE_ENABLED 0x20 ///< Zero-TC bias generator forced on.                 
                                                                                                
//------------------------------------------------------------------------------
// REG0CN Enums (Voltage Regulator Control @ 0xC9)
//------------------------------------------------------------------------------
#define REG0CN_DROPOUT__BMASK   0x01 ///< Voltage Regulator Dropout Indicator     
#define REG0CN_DROPOUT__SHIFT   0x00 ///< Voltage Regulator Dropout Indicator     
#define REG0CN_DROPOUT__NOT_SET 0x00 ///< Voltage Regulator is not in dropout.    
#define REG0CN_DROPOUT__SET     0x01 ///< Voltage Regulator is in or near dropout.
                                                                                  
#define REG0CN_REGMD__BMASK     0x10 ///< Voltage Regulator Output Mode           
#define REG0CN_REGMD__SHIFT     0x04 ///< Voltage Regulator Output Mode           
#define REG0CN_REGMD__2P1       0x00 ///< Voltage Regulator output is 2.1 V.      
#define REG0CN_REGMD__2P6       0x10 ///< Voltage Regulator output is 2.6 V.      
                                                                                  
#define REG0CN_REGDIS__BMASK    0x80 ///< Voltage Regulator Disable               
#define REG0CN_REGDIS__SHIFT    0x07 ///< Voltage Regulator Disable               
#define REG0CN_REGDIS__ENABLED  0x00 ///< Enable the Voltage Regulator.           
#define REG0CN_REGDIS__DISABLED 0x80 ///< Disable the Voltage Regulator.          
                                                                                  
//------------------------------------------------------------------------------
// EMI0CN Enums (External Memory Interface Control @ 0xAA)
//------------------------------------------------------------------------------
#define EMI0CN_PGSEL__FMASK 0xFF ///< XRAM Page Select
#define EMI0CN_PGSEL__SHIFT 0x00 ///< XRAM Page Select
                                                      
#endif // SI_C8051F540_REGISTER_ENUMS_H
//-eof--------------------------------------------------------------------------

